## Production: glue 🧴
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          NAME                           |
|--------|---------------------------------------------------------|
| update | `aws_glue_resource_policy.cross_account_access`         |
| add    | `aws_glue_catalog_database.platform_support_production` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_glue_catalog_database.platform_support_production will be created
  + resource "aws_glue_catalog_database" "platform_support_production" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "TRANSFORMED: data source path: /platform/support/*"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "platform_support_production"
      + tags_all     = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_resource_policy.cross_account_access will be updated in-place
  ~ resource "aws_glue_resource_policy" "cross_account_access" {
        id     = "ca-central-1"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    # (2 unchanged elements hidden)
                    {
                        Action    = [
                            "glue:GetTables",
                            "glue:GetTableVersions",
                            "glue:GetTableVersion",
                            "glue:GetTable",
                            "glue:GetPartitions",
                            "glue:GetPartition",
                            "glue:GetDatabases",
                            "glue:GetDatabase",
                            "glue:BatchGetPartition",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::257394494478:role/SupersetAthenaRead-platform_gc_forms_production"
                        }
                        Resource  = [
                            "arn:aws:glue:ca-central-1:739275439843:table/platform_gc_forms_production/*",
                            "arn:aws:glue:ca-central-1:739275439843:database/platform_gc_forms_production",
                            "arn:aws:glue:ca-central-1:739275439843:catalog",
                        ]
                        Sid       = "SupersetReadAccessPlatformGcFormsProduction"
                    },
                  + {
                      + Action    = [
                          + "glue:GetTables",
                          + "glue:GetTableVersions",
                          + "glue:GetTableVersion",
                          + "glue:GetTable",
                          + "glue:GetPartitions",
                          + "glue:GetPartition",
                          + "glue:GetDatabases",
                          + "glue:GetDatabase",
                          + "glue:BatchGetPartition",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = []
                        }
                      + Resource  = [
                          + "arn:aws:glue:ca-central-1:739275439843:table/platform_support_production/*",
                          + "arn:aws:glue:ca-central-1:739275439843:database/platform_support_production",
                          + "arn:aws:glue:ca-central-1:739275439843:catalog",
                        ]
                      + Sid       = "SupersetReadAccessPlatformSupportProduction"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_account_tags"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_cost_usage_report"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_forms_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_support_freshdesk_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.forms_generate_test_data"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.aws_glue"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.forms_generate_test_data"]

35 tests, 19 passed, 16 warnings, 0 failures, 0 exceptions

```

</details>
